{
    "story": [
        "Stormy night at sea, with raging winds and waves tossing the ship.",
        "Stormy night at sea, Robinson swimming in the sea.",
        "Stormy night at sea, Robinson swept away by waves, clutching a broken plank.",
        "At dawn, Robinson lie on a deserted island beach.",
        "Close-up of Robinson's face as he wakes on the island.",
        "Robinson walk in the forest.",
        "Robinson finds a stream in the forest.",
        "Robinson holds the water of the stream in hand.",
        "Robinson holds branches in the forest.",
        "Robinson builds a wood shelter in the forest.",
        "Robinson starting a fire with a flint in the forest.",
        "Robinson sits by the fire in the forest.",
        "Robinson picks fruit trees in the forest.",
        "Robinson clearing a small plot of land in the forest.",
        "Robinson watered the wheat in the forest.",
        "Robinson catching rabbit in the forest.",
        "Robinson tames goats in the forest.",
        "goats eat grass in the forest.",
        "Robinson roasting in the forest at night.",
        "Robinson writing in the forest shelter at night.",
        "Robinson uses hammers to repair a wood boat on the island.",
        "Robinson attempts to sail out with wood boat.",
        "wood boat forced back by storms and currents.",
        "Robinson stood at the highest point in the forested mesas.",
        "Big footprints appeared in the forest road.",
        "Orangutans roasting in the forest",
        "Friday was tied up with a rope in the forest.",
        "Robinson and Friday run in the forest.",
        "orangutans run in the forest.",
        "Robinson and Friday talk on the beach.",
        "Robinson and Friday stone shelters in the forest.",
        "Robinson making spear in the island.",
        "orangutans discover camp in the forest.",
        "orangutans fire camp in the forest.",
        "Robinson and orangutans in the forest.",
        "Robinson punches orangutans in the forest.",
        "Friday find European ship approaching deserted beaches.",
        "Crew lands on the island.",
        "Crew shoot orangutans in the forest.",
        "Friday waving to Robinson on the beach.",
        "Robinson waving on the ship.",
        "Robinson walk in the city streets.",
        "Rubenson talk with the journalist.",
        "Robinson hug with his wife in the city street.",
        "Robinson writing diary at home.",
        "Robinson see newspaper at home.",
        "Robinson eat dinner at home.",
        "Robinson walks in the garden.",
        "Robinson sit in a church.",
        "Robinson is sleeping in the bed in the house."
    ],
    "character_replacements": {
        "Robinson": "a man, wearing tattered sailor clothes.",
        "Friday": "a chimpanzee."
    }
}
